const errorCode = {
  200: '成功',
  201: '新增成功',
  401: 'Unauthorized',
  403: 'Forbidden',
  404: 'Not Found',
  501: '查無此帳號', // login
  502: '密碼錯誤', // login
  503: '密碼輸入錯誤五次，請聯絡客服人員0809-053-888', // login
  504: '登錄/註冊異常', // login signup
  // 505: '帳號申請中', // login
  505: '帳號未註冊完成，請點選下方「重發認證碼」以完成認證註冊', // login
  506: '資料錯誤',
  507: '臨時密碼過期', // login
  508: '帳號失效', // login
  509: '帳號已被鎖碼', // login
  510: '身分證居留證異常', // signup
  511: '很抱歉，您目前無法於ViVa TV網站註冊，若有疑問請洽客服專線0809-053-888', // signup
  512: '會員狀態錯誤(HSS帳號比對)', // login
  513: '程序異常錯誤',
  514: '必要資料有空值', // login siup
  515: '此帳號已申請過會員註冊', // login

  516: '您已從非TV會員變成TV會員，請重新註冊', // signup

  517: '登入狀態異常',

  518: '閒置時間過長，系統已將您自動登出', // 驗證過期，已自動登出

  519: '很抱歉，您目前無法於ViVa TV網站修改資料，若有疑問請洽客服專線0809-053-888', // 修改會員資料 memberprofile

  520: '會員資料修改失敗',

  521: '新密碼不可與前一次密碼相同，請重新輸入',

  522: '帳號尚未登入',

  523: '會員狀態非授權中',

  524: '授權失敗',

  525: '請客人聯絡客服',

  526: '親愛的會員您好:您填寫資料有誤，請再確認填寫內容。如有問題請電0809-053-888由專人為您服務。',

  527: '帳號已開通',

  528: '帳號已鎖住，請電0809-053-888由專人為您服務',

  529: '帳號不存在',

  530: '生日信箱錯誤',

  531: '生日錯誤',

  533: '您於其他設備重複登入，系統已將您自動登出', // 已在其他地方登入

  534: '優惠金錯誤',

  535: '購物車刪除失敗',

  536: '暫收款錯誤',

  537: '商品數量不足',

  538: '商品已下架',

  539: '結帳金額過大',

  540: '有商品數量為0',

  541: '查不到組合商品資料',
  542: '結帳金額超過每日上限，請聯絡客服人員0809-052-777協助為您結帳，謝謝。',

  543: '數據庫發生錯誤',

  544: '系統錯誤',

  545: '信用卡授權失敗,請重新選擇付款方式!',
  546: '發卡銀行不存在',
  547: '分期期數不合法',
  548: '暫收款錯誤',
  549: '手機條碼錯誤',
  550: '購物車無此商品資料',
  551: '離島無法配送',
  552: '新密碼不能與舊密碼相同，請重新輸入',
  553: '密碼解密錯誤',
  554: '商品不存在',
  555: '網路訂單地址無法修改為離島',
  556: '手機格式錯誤',
  557: '電視會員的身份證資料與輸入的身份證資料不相同',
  558: '電視會員的出生日期資料與輸入的出生日期資料不相同',
  559: '此帳號在電視會員中已停用',

  // 活動使用
  560: '會員註冊失敗，請聯絡客服人員0809-052-777為您協助。',
  561: '時間區間錯誤',
  562: '您好，今日的簽到活動已滿(50名/日)，明日請早',
  563: '今日已簽到',
  564: '您好，目前非活動期間',
  565: '您好，您已參加過活動',
  566: '您好，您不符合活動資格',
  567: '您好，您已登記過活動',
  568: '您好，您非登記名單會員',
  // 活動使用

  569: '縣市/鄉鎮區不符合',
  570: '無活動',
  571: '訂單收件人姓名過長',
  572: '訂單金額不正確(訂單欄位有小數)',
  573: '三聯式統一編號不正確',
  574: '生日必須為數值',
  575: '未通過授權驗證，請重新登入',
  576: '補貨/開賣通知不存在',
  577: '收藏不存在',
  578: 'email格式錯誤',
  579: '合作內容過長!',
  580: '輸入的生日與HSS不符',
  581: '門檻項目不存在',
  582: '活動登錄已額滿',
  583: '登錄作業程序異常，請重新再試乙次或洽系統服務人員',
  584: '問題內容過長!'
}
